src/cfe/КСП/Reports/КСП_СостояниеВыкупаОбщий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>КСП_СостояниеВыкупаОбщий</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/cfe/КСП/AccumulationRegisters/ЗаказыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказыКлиентов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заказано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОформлению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КПередаче</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/РаспределениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РаспределениеЗапасов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свободно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Зарезервировано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Обеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеОбеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОбеспечениюБезРезерва</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтложитьРезервирование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервироватьПоМереПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Резервировать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РаспределениеЗапасовСостояния</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказНаОтгрузку</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузка</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказНаПоступление</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемоеПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/Reports/КСП_СостояниеВыкупаОбщий/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	//НастройкиКомпоновки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;  
    НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	Для Каждого эл Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(эл) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
		Иначе
			Если эл.Параметр = Новый ПараметрКомпоновкиДанных("Период") Тогда
				ДатаНачала = эл.Значение.ДатаНачала;
				ДатаОкончания = эл.Значение.ДатаОкончания;
			КонецЕсли;
			
			Если эл.Параметр = Новый ПараметрКомпоновкиДанных("СкладОТП") Тогда
				СкладОТП = эл.Значение;	
			КонецЕсли;
			
			Если эл.Параметр = Новый ПараметрКомпоновкиДанных("Организация") Тогда
				Организация = эл.Значение;
			КонецЕсли;
	    КонецЕсли;
		
	КонецЦикла;   
	
	ТаблицаИсточник = ПолучениеТаблици(ДатаНачала, ДатаОкончания, СкладОТП, Организация);
	
	 ВнешнийНаборДанных = Новый Структура("ТаблицаДанных", ТаблицаИсточник);
	// НастройкиКомпоновки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(Новый ПараметрКомпоновкиДанных("Период"));
		
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки);
     
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных);
     
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);	
	
КонецПроцедуры

Функция ПолучениеТаблици(ДатаНачала, ДатаКонца, СкладОТП, Организация)
	
		Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
	               |	ЗаказКлиентаТовары.Отменено КАК Отменено
	               |ПОМЕСТИТЬ ЗакрытПоТЧСтрока
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |ГДЕ
	               |	ЗаказКлиентаТовары.НомерСтроки = 1
	               |	И ЗаказКлиентаТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказКлиентаТовары.Отменено,
	               |	ЗаказКлиентаТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ЗаказыКлиентов.ЗаказКлиента КАК Заказ,
	               |	ВЫБОР
	               |		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Отменено) = 1
	               |			ТОГДА ЗакрытПоТЧСтрока.Отменено
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Отменено,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Отменено) КАК НомерСтроки,
	               |	ЗаказыКлиентов.Регистратор КАК Регистратор,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗаказКлиентаТовары.Отменено = ИСТИНА
	               |				ТОГДА 0
	               |			ИНАЧЕ ЗаказКлиентаТовары.Сумма
	               |		КОНЕЦ) КАК СуммаОтменено
	               |ПОМЕСТИТЬ закрытПоТЧ
	               |ИЗ
	               |	РегистрНакопления.ЗаказыКлиентов КАК ЗаказыКлиентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ЗакрытПоТЧСтрока КАК ЗакрытПоТЧСтрока
	               |			ПО ЗаказКлиентаТовары.Ссылка = ЗакрытПоТЧСтрока.Ссылка
	               |		ПО ЗаказыКлиентов.Регистратор = ЗаказКлиентаТовары.Ссылка
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказыКлиентов.ЗаказКлиента,
	               |	ЗакрытПоТЧСтрока.Отменено,
	               |	ЗаказыКлиентов.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ЗаказыКлиентов.ЗаказКлиента КАК Заказ,
	               |	ВЫБОР
	               |		КОГДА закрытПоТЧ.Отменено = ИСТИНА
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПоступлениеБезналичныхДенежныхСредств.СуммаДокумента = ЗаказКлиентаТовары.Ссылка.СуммаДокумента - закрытПоТЧ.СуммаОтменено
	               |						И РеализацияТоваровУслуг.СуммаДокумента = ЗаказКлиентаТовары.Ссылка.СуммаДокумента - закрытПоТЧ.СуммаОтменено
	               |					ТОГДА ИСТИНА
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ПризнакЗакрытияЗаказа,
	               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ закрыт
	               |ИЗ
	               |	РегистрНакопления.ЗаказыКлиентов КАК ЗаказыКлиентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
	               |		ПО ЗаказыКлиентов.Регистратор = ПоступлениеБезналичныхДенежныхСредств.ДокументОснование
	               |			И ЗаказыКлиентов.ЗаказКлиента = ПоступлениеБезналичныхДенежныхСредств.ДокументОснование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ЗаказыКлиентов.Регистратор = РеализацияТоваровУслуг.ЗаказКлиента
	               |			И ЗаказыКлиентов.ЗаказКлиента = РеализацияТоваровУслуг.ЗаказКлиента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |		ПО ЗаказыКлиентов.Регистратор = ЗаказКлиентаТовары.Ссылка
	               |			И ЗаказыКлиентов.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ закрытПоТЧ КАК закрытПоТЧ
	               |		ПО ЗаказыКлиентов.Регистратор = закрытПоТЧ.Заказ
	               |			И ЗаказыКлиентов.ЗаказКлиента = закрытПоТЧ.Заказ
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказыКлиентов.ЗаказКлиента,
	               |	ПоступлениеБезналичныхДенежныхСредств.СуммаДокумента,
	               |	ЗаказыКлиентов.Сумма,
	               |	ВЫБОР
	               |		КОГДА закрытПоТЧ.Отменено = ИСТИНА
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПоступлениеБезналичныхДенежныхСредств.СуммаДокумента = ЗаказКлиентаТовары.Ссылка.СуммаДокумента - закрытПоТЧ.СуммаОтменено
	               |						И РеализацияТоваровУслуг.СуммаДокумента = ЗаказКлиентаТовары.Ссылка.СуммаДокумента - закрытПоТЧ.СуммаОтменено
	               |					ТОГДА ИСТИНА
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	РеализацияТоваровУслуг.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
	               |	РаспределениеЗапасов.Характеристика КАК Характеристика,
	               |	СУММА(РаспределениеЗапасов.Свободно) КАК Свободно,
	               |	СУММА(РаспределениеЗапасов.Резерв) КАК Резерв
	               |ПОМЕСТИТЬ Запасы
	               |ИЗ
	               |	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РаспределениеЗапасов.Номенклатура,
	               |	РаспределениеЗапасов.Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	СТРОКА(ЗаказКлиентаТовары.Номенклатура.КоллекцияНоменклатуры.ДатаНачалаПродаж) + "", "" + СТРОКА(ЗаказКлиентаТовары.Номенклатура.КоллекцияНоменклатуры.ДатаЗапретаПродажи) КАК ПериодВывески,
	               |	СУММА(ЗаказКлиентаТовары.Сумма) КАК Сумма,
	               |	ЗаказКлиентаТовары.Ссылка.Ссылка КАК Ссылка,
	               |	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество,
	               |	ЗаказКлиентаТовары.Номенклатура.КСП_АртикулУПП.Капсула.ПериодВывески КАК ПериодВывески1
	               |ПОМЕСТИТЬ ТЧДокЗаказы
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка.Проведен = ИСТИНА
	               |	И ЗаказКлиентаТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказКлиентаТовары.Ссылка.Ссылка,
	               |	СТРОКА(ЗаказКлиентаТовары.Номенклатура.КоллекцияНоменклатуры.ДатаНачалаПродаж) + "", "" + СТРОКА(ЗаказКлиентаТовары.Номенклатура.КоллекцияНоменклатуры.ДатаЗапретаПродажи),
	               |	ЗаказКлиентаТовары.Номенклатура.КСП_АртикулУПП.Капсула.ПериодВывески
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	РаспределениеЗапасов.Номенклатура КАК Номенклатура1,
	               |	РаспределениеЗапасов.Характеристика КАК Характеристика1,
	               |	СУММА(РаспределениеЗапасов.Свободно) КАК КоличествоСвободныйОстатокНаСкладеОТПДляЗакрытияПотребности
	               |ПОМЕСТИТЬ ЗапасыИПотребности
	               |ИЗ
	               |	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	               |ГДЕ
	               |	РаспределениеЗапасов.Склад = &СкладОТП
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РаспределениеЗапасов.Номенклатура,
	               |	РаспределениеЗапасов.Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ЗаказКлиентаТовары.Ссылка.Соглашение КАК Соглашение,
	               |	ЗаказКлиентаТовары.Ссылка.Склад КАК Склад,
	               |	ЗаказКлиентаТовары.Ссылка.Соглашение.ИндивидуальныйВидЦены КАК СоглашениеВидЦен,
	               |	ЗаказКлиентаТовары.Ссылка.Склад.Родитель КАК СкладРодитель,
	               |	СУММА(ЗаказыКлиентов.Заказано) КАК Заказано,
	               |	СУММА(ЗаказыКлиентов.Сумма) КАК СуммаЗаказСУчетомКорректировок,
	               |	СУММА((ЗаказыКлиентов.Заказано - ЗаказыКлиентовОстаткиИОбороты.КОформлениюРасход) * (ЗаказыКлиентов.Сумма / ВЫБОР
	               |			КОГДА ЗаказыКлиентов.Заказано = 0
	               |				ТОГДА 1
	               |			ИНАЧЕ ЗаказыКлиентов.Заказано
	               |		КОНЕЦ)) КАК ОстатокЗаказаВЦенахЗаявки,
	               |	МАКСИМУМ(ЗаказыКлиентовОстаткиИОбороты.КОформлениюРасход) КАК КоличествоОтгружено,
	               |	СУММА(ЗаказыКлиентовОстаткиИОбороты.КОформлениюРасход * (ЗаказыКлиентов.Сумма / ВЫБОР
	               |			КОГДА ЗаказыКлиентов.Заказано = 0
	               |				ТОГДА 1
	               |			ИНАЧЕ ЗаказыКлиентов.Заказано
	               |		КОНЕЦ)) КАК СуммаОтгруженоВЦенахЗаявки,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗаказыКлиентов.Заказано - ЗаказыКлиентовОстаткиИОбороты.КОформлениюРасход < 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ЗаказыКлиентов.Заказано - ЗаказыКлиентовОстаткиИОбороты.КОформлениюРасход
	               |		КОНЕЦ) КАК КоличествоОсталосьОтгрузить,
	               |	СРЕДНЕЕ(ЗаказыКлиентовОстаткиИОбороты.КОформлениюРасход / ВЫБОР
	               |			КОГДА ЗаказыКлиентов.Заказано = 0
	               |				ТОГДА 1
	               |			ИНАЧЕ ЗаказыКлиентов.Заказано
	               |		КОНЕЦ * 100) КАК ПроцентВыкупа,
	               |	МАКСИМУМ(ЗаказыКлиентовОстаткиИОбороты.КОформлениюПриход) КАК КоличествоРезерв,
	               |	МИНИМУМ(ЗаказыКлиентовОстаткиИОбороты.КОформлениюПриход + ЗаказыКлиентов.КОформлению) КАК ОтгрузкаИРезервШт,
	               |	МИНИМУМ(ЗаказыКлиентовОстаткиИОбороты.КОформлениюПриход + ЗаказыКлиентов.КОформлению) КАК ПроцентОтгрузкаРезервОтЗаказа,
	               |	ЗаказКлиентаТовары.Ссылка.Подразделение КАК ОТП,
	               |	ЗаказКлиентаТовары.Ссылка.Партнер КАК Контрагент,
	               |	ЗаказКлиентаТовары.Ссылка.Партнер.БизнесРегион КАК Субрегион,
	               |	ЗаказыКлиентов.Номенклатура КАК Номенклатура,
	               |	ЗаказКлиентаТовары.Ссылка КАК Заказ,
	               |	ЗаказыКлиентов.КодСтроки КАК КодСтроки,
	               |	ЗаказыКлиентов.Характеристика КАК Характеристика,
	               |	СУММА(ЗаказыКлиентовОстаткиИОбороты.КОформлениюРасход) КАК КОформлениюРасход
	               |ПОМЕСТИТЬ РНЗаказы
	               |ИЗ
	               |	РегистрНакопления.ЗаказыКлиентов КАК ЗаказыКлиентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |		ПО ЗаказыКлиентов.Регистратор = ЗаказКлиентаТовары.Ссылка
	               |			И ЗаказыКлиентов.Номенклатура = ЗаказКлиентаТовары.Номенклатура
	               |			И ЗаказыКлиентов.Характеристика = ЗаказКлиентаТовары.Характеристика
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыКлиентов.ОстаткиИОбороты КАК ЗаказыКлиентовОстаткиИОбороты
	               |		ПО ЗаказыКлиентов.Регистратор = ЗаказыКлиентовОстаткиИОбороты.ЗаказКлиента
	               |			И ЗаказыКлиентов.Номенклатура = ЗаказыКлиентовОстаткиИОбороты.Номенклатура
	               |			И ЗаказыКлиентов.Характеристика = ЗаказыКлиентовОстаткиИОбороты.Характеристика
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка <> """"
	               |	И ЗаказыКлиентов.Заказано > 0
	               |	И ЗаказКлиентаТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказКлиентаТовары.Ссылка,
	               |	ЗаказКлиентаТовары.Ссылка.Склад,
	               |	ЗаказКлиентаТовары.Ссылка.Партнер,
	               |	ЗаказКлиентаТовары.Ссылка.Соглашение,
	               |	ЗаказКлиентаТовары.Ссылка.Подразделение,
	               |	ЗаказКлиентаТовары.Ссылка.Склад.Родитель,
	               |	ЗаказКлиентаТовары.Ссылка.Партнер.БизнесРегион,
	               |	ЗаказыКлиентов.Регистратор,
	               |	ЗаказыКлиентов.Номенклатура,
	               |	ЗаказКлиентаТовары.Ссылка.Соглашение.ИндивидуальныйВидЦены,
	               |	ЗаказыКлиентов.КодСтроки,
	               |	ЗаказыКлиентов.Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ЗапасыИПотребности.КоличествоСвободныйОстатокНаСкладеОТПДляЗакрытияПотребности КАК КоличествоСвободныйОстатокНаСкладеОТПДляЗакрытияПотребности,
	               |	ЗапасыИПотребности.КоличествоСвободныйОстатокНаСкладеОТПДляЗакрытияПотребности * (РНЗаказы.СуммаЗаказСУчетомКорректировок / РНЗаказы.Заказано) КАК СуммаСвободныйОстатокНаСкладеОТПДляЗакрытияПотребности,
	               |	РНЗаказы.Номенклатура КАК Номенклатура,
	               |	РНЗаказы.Характеристика КАК Характеристика,
	               |	Запасы.Свободно КАК ОстатокТовараНаУказанномСкладеЗаМинусомРезерва,
	               |	РНЗаказы.КоличествоОтгружено КАК КоличествоОтгружено,
	               |	РНЗаказы.КОформлениюРасход * (РНЗаказы.СуммаЗаказСУчетомКорректировок / РНЗаказы.Заказано) КАК ОстатокЗаказаВЦенахЗаявки,
	               |	РНЗаказы.Заказано КАК Заказано,
	               |	РНЗаказы.Заказ КАК Заказ,
	               |	Запасы.Свободно КАК Свободно,
	               |	Запасы.Резерв КАК Резерв,
	               |	РНЗаказы.Соглашение КАК Соглашение,
	               |	РНЗаказы.Склад КАК Склад,
	               |	РНЗаказы.СоглашениеВидЦен КАК СоглашениеВидЦен,
	               |	РНЗаказы.СкладРодитель КАК СкладРодитель,
	               |	РНЗаказы.СуммаОтгруженоВЦенахЗаявки КАК СуммаОтгруженоВЦенахЗаявки,
	               |	РНЗаказы.КоличествоОсталосьОтгрузить КАК КоличествоОсталосьОтгрузить,
	               |	РНЗаказы.ПроцентВыкупа КАК ПроцентВыкупа,
	               |	РНЗаказы.КоличествоРезерв КАК КоличествоРезерв,
	               |	РНЗаказы.ОтгрузкаИРезервШт КАК ОтгрузкаИРезервШт,
	               |	РНЗаказы.ПроцентОтгрузкаРезервОтЗаказа / ВЫБОР
	               |		КОГДА ЗапасыИПотребности.КоличествоСвободныйОстатокНаСкладеОТПДляЗакрытияПотребности = 0
	               |			ТОГДА 1
	               |		ИНАЧЕ РНЗаказы.Заказано
	               |	КОНЕЦ * 100 КАК ПроцентОтгрузкаРезервОтЗаказа,
	               |	РНЗаказы.ОТП КАК ОТП,
	               |	РНЗаказы.Контрагент КАК Контрагент,
	               |	РНЗаказы.Субрегион КАК Субрегион,
	               |	РНЗаказы.СуммаЗаказСУчетомКорректировок КАК СуммаЗаказСУчетомКорректировок,
	               |	ТЧДокЗаказы.ПериодВывески КАК ПериодВывески,
	               |	ТЧДокЗаказы.ПериодВывески1 КАК ПериодВывески1
	               |ПОМЕСТИТЬ Предфинал
	               |ИЗ
	               |	РНЗаказы КАК РНЗаказы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Запасы КАК Запасы
	               |		ПО РНЗаказы.Номенклатура = Запасы.Номенклатура
	               |			И РНЗаказы.Характеристика = Запасы.Характеристика
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЧДокЗаказы КАК ТЧДокЗаказы
	               |		ПО РНЗаказы.Заказ = ТЧДокЗаказы.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ закрыт КАК закрыт
	               |		ПО (закрыт.Ссылка.ЗаказКлиента = РНЗаказы.Заказ)
	               |			И (закрыт.Заказ = РНЗаказы.Заказ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗапасыИПотребности КАК ЗапасыИПотребности
	               |		ПО РНЗаказы.Номенклатура = ЗапасыИПотребности.Номенклатура1
	               |			И РНЗаказы.Характеристика = ЗапасыИПотребности.Характеристика1
	               |ГДЕ
	               |	РНЗаказы.Контрагент.Ссылка <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	               |	И РНЗаказы.Заказано > 0
	               |	И закрыт.ПризнакЗакрытияЗаказа = ЛОЖЬ
	               |	И РНЗаказы.Заказ.Организация = &Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(Предфинал.КоличествоСвободныйОстатокНаСкладеОТПДляЗакрытияПотребности) КАК КоличествоСвободныйОстатокНаСкладеОТПДляЗакрытияПотребности,
	               |	СУММА(Предфинал.СуммаСвободныйОстатокНаСкладеОТПДляЗакрытияПотребности) КАК СуммаСвободныйОстатокНаСкладеОТПДляЗакрытияПотребности,
	               |	СУММА(Предфинал.ОстатокТовараНаУказанномСкладеЗаМинусомРезерва) КАК ОстатокТовараНаУказанномСкладеЗаМинусомРезерва,
	               |	СУММА(Предфинал.КоличествоОтгружено) КАК КоличествоОтгружено,
	               |	СУММА(Предфинал.ОстатокЗаказаВЦенахЗаявки) КАК ОстатокЗаказаВЦенахЗаявки,
	               |	СУММА(Предфинал.Заказано) КАК Заказано,
	               |	Предфинал.Заказ КАК Заказ,
	               |	СУММА(Предфинал.СуммаЗаказСУчетомКорректировок) КАК СуммаЗаказСУчетомКорректировок,
	               |	СУММА(Предфинал.Свободно) КАК Свободно,
	               |	СУММА(Предфинал.Резерв) КАК Резерв,
	               |	Предфинал.Соглашение КАК Соглашение,
	               |	Предфинал.Склад КАК Склад,
	               |	Предфинал.СоглашениеВидЦен КАК СоглашениеВидЦен,
	               |	Предфинал.СкладРодитель КАК СкладРодитель,
	               |	СУММА(Предфинал.СуммаОтгруженоВЦенахЗаявки) КАК СуммаОтгруженоВЦенахЗаявки,
	               |	СУММА(Предфинал.КоличествоОсталосьОтгрузить) КАК КоличествоОсталосьОтгрузить,
	               |	СУММА(Предфинал.ПроцентВыкупа) КАК ПроцентВыкупа,
	               |	СУММА(Предфинал.КоличествоРезерв) КАК КоличествоРезерв,
	               |	СУММА(Предфинал.ОтгрузкаИРезервШт) КАК ОтгрузкаИРезервШт,
	               |	СУММА(Предфинал.ПроцентОтгрузкаРезервОтЗаказа) КАК ПроцентОтгрузкаРезервОтЗаказа,
	               |	Предфинал.ОТП КАК ОТП,
	               |	Предфинал.Контрагент КАК Контрагент,
	               |	Предфинал.Субрегион КАК Субрегион,
	               |	Предфинал.ПериодВывески КАК ПериодВывески,
	               |	Предфинал.ПериодВывески1 КАК ПериодВывески1
	               |ПОМЕСТИТЬ ПочтиФинал
	               |ИЗ
	               |	Предфинал КАК Предфинал
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Предфинал.Заказ,
	               |	Предфинал.Соглашение,
	               |	Предфинал.Склад,
	               |	Предфинал.СоглашениеВидЦен,
	               |	Предфинал.СкладРодитель,
	               |	Предфинал.ОТП,
	               |	Предфинал.Контрагент,
	               |	Предфинал.Субрегион,
	               |	Предфинал.ПериодВывески,
	               |	Предфинал.ПериодВывески1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПочтиФинал.ОТП КАК ОТП,
	               |	ПочтиФинал.Субрегион КАК Субрегион,
	               |	ПочтиФинал.ПериодВывески КАК ПериодВывески,
	               |	ПочтиФинал.Контрагент КАК Контрагент,
	               |	ПочтиФинал.Соглашение КАК Соглашение,
	               |	ПочтиФинал.ОстатокТовараНаУказанномСкладеЗаМинусомРезерва КАК ОстатокТовараНаУказанномСкладеЗаМинусомРезерва,
	               |	ПочтиФинал.КоличествоСвободныйОстатокНаСкладеОТПДляЗакрытияПотребности КАК КоличествоСвободныйОстатокНаСкладеОТПДляЗакрытияПотребности,
	               |	ПочтиФинал.СуммаСвободныйОстатокНаСкладеОТПДляЗакрытияПотребности КАК СуммаСвободныйОстатокНаСкладеОТПДляЗакрытияПотребности,
	               |	ПочтиФинал.КоличествоОтгружено КАК КоличествоОтгружено,
	               |	ПочтиФинал.ОстатокЗаказаВЦенахЗаявки КАК ОстатокЗаказаВЦенахЗаявки,
	               |	ПочтиФинал.Заказано КАК Заказано,
	               |	ПочтиФинал.Заказ КАК Заказ,
	               |	ПочтиФинал.СуммаЗаказСУчетомКорректировок КАК СуммаЗаказСУчетомКорректировок,
	               |	ПочтиФинал.Свободно КАК Свободно,
	               |	ПочтиФинал.Резерв КАК Резерв,
	               |	ПочтиФинал.Склад КАК Склад,
	               |	ПочтиФинал.СоглашениеВидЦен КАК СоглашениеВидЦен,
	               |	ПочтиФинал.СкладРодитель КАК СкладРодитель,
	               |	ПочтиФинал.СуммаОтгруженоВЦенахЗаявки КАК СуммаОтгруженоВЦенахЗаявки,
	               |	ПочтиФинал.КоличествоОсталосьОтгрузить КАК КоличествоОсталосьОтгрузить,
	               |	ПочтиФинал.КоличествоОтгружено / ПочтиФинал.Заказано * 100 КАК ПроцентВыкупа,
	               |	ПочтиФинал.КоличествоРезерв КАК КоличествоРезерв,
	               |	ПочтиФинал.ОтгрузкаИРезервШт КАК ОтгрузкаИРезервШт,
	               |	ПочтиФинал.ОтгрузкаИРезервШт / ПочтиФинал.Заказано * 100 КАК ПроцентОтгрузкаРезервОтЗаказа,
	               |	ПочтиФинал.ПериодВывески1 КАК ПериодВывески1
	               |ИЗ
	               |	ПочтиФинал КАК ПочтиФинал
	               |ИТОГИ ПО
	               |	ОТП,
	               |	Субрегион,
	               |	ПериодВывески,
	               |	Контрагент,
	               |	Соглашение";;
	
	Запрос.УстановитьПараметр("СкладОТП", СкладОТП);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(ДатаКонца));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат РезультатЗапроса;
	
КонецФункции
